USE vk;

-- 1 --------------------------------------------------------
/*
 * 
 *  Пусть задан некоторый пользователь. 
 *  Из всех пользователей соц. сети найдите человека, 
 *  который больше всех общался с выбранным пользователем (написал ему сообщений).
 * 
 */

SELECT a.id , 



-- 2 --------------------------------------------------------
/*
 * 
 *  Подсчитать общее количество лайков, которые получили пользователи младше 10 лет.
 * 
 * 
 */

-- 3 --------------------------------------------------------
/*
 * 
 *  Определить кто больше поставил лайков (всего): мужчины или женщины.
 * 
 * 
 */

